In [2]:
import pandas as pd

data analysis
1.description
2.diagnosis
3.prediction
4.action/ prescription

In [3]:
df=pd.read_csv('u.data')

In [4]:
df

            0\t50\t5\t881250949
0          0\t172\t5\t881250949
1          0\t133\t1\t881250949
2        196\t242\t3\t881250949
3        186\t302\t3\t891717742
4         22\t377\t1\t878887116
...                         ...
99997    880\t476\t3\t880175444
99998    716\t204\t5\t879795543
99999   276\t1090\t1\t874795795
100000    13\t225\t2\t882399156
100001    12\t203\t3\t879959583

[100002 rows x 1 columns]

In [5]:
df.head()

      0\t50\t5\t881250949
0    0\t172\t5\t881250949
1    0\t133\t1\t881250949
2  196\t242\t3\t881250949
3  186\t302\t3\t891717742
4   22\t377\t1\t878887116

In [6]:
# the column names
cols=['user id','movie id','rating','ts']

In [7]:
# read the file
df=pd.read_csv('u.data',sep='\t',names=cols)

In [8]:
item_cols=['movie id','title']+[str(i) for i in range(22)]

In [9]:
# read the other file
df1=pd.read_csv('u.item',sep='|',names= item_cols ,encoding="ISO-8859-1")[[ 'movie id','title']]

exploratory data analysis(EDA)

In [10]:
df.head()

   user id  movie id  rating         ts
0        0        50       5  881250949
1        0       172       5  881250949
2        0       133       1  881250949
3      196       242       3  881250949
4      186       302       3  891717742

In [11]:
df.sample(8)

       user id  movie id  rating         ts
16663      428       316       4  892572382
9081       318       127       5  884470970
96496      109       595       3  880572108
70454      452        82       3  886149040
49821      738       127       4  892957753
36377        7       429       5  891351002
66145      790        96       3  885155648
67656      911       485       3  892839454

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100003 entries, 0 to 100002
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   user id   100003 non-null  int64
 1   movie id  100003 non-null  int64
 2   rating    100003 non-null  int64
 3   ts        100003 non-null  int64
dtypes: int64(4)
memory usage: 3.1 MB

In [13]:
# to define int column datatype
df.describe()

             user id       movie id         rating            ts
count  100003.000000  100003.000000  100003.000000  1.000030e+05
mean      462.470876     425.520914       3.529864  8.835288e+08
std       266.622454     330.797791       1.125704  5.343791e+06
min         0.000000       1.000000       1.000000  8.747247e+08
25%       254.000000     175.000000       3.000000  8.794487e+08
50%       447.000000     322.000000       4.000000  8.828269e+08
75%       682.000000     631.000000       4.000000  8.882600e+08
max       943.000000    1682.000000       5.000000  8.932866e+08

In [14]:
# to define all the columns of all datatype
df.describe(include='all')

             user id       movie id         rating            ts
count  100003.000000  100003.000000  100003.000000  1.000030e+05
mean      462.470876     425.520914       3.529864  8.835288e+08
std       266.622454     330.797791       1.125704  5.343791e+06
min         0.000000       1.000000       1.000000  8.747247e+08
25%       254.000000     175.000000       3.000000  8.794487e+08
50%       447.000000     322.000000       4.000000  8.828269e+08
75%       682.000000     631.000000       4.000000  8.882600e+08
max       943.000000    1682.000000       5.000000  8.932866e+08

#type of information member
#1.categorical string info
#2 number with  quantifying info
#3.strings with random stuff
#3.numbers with categorical info
#4 random numbers or id sort of data

In [15]:
df.columns

Index(['user id', 'movie id', 'rating', 'ts'], dtype='object')

In [16]:
df['rating'].unique()

array([5, 1, 3, 2, 4], dtype=int64)

In [17]:
df['rating'].nunique()

5

In [18]:
#categorical
df['user id'].nunique()

944

In [19]:
df['movie id'].nunique()

1682

In [20]:
df1.sample(5)

      movie id                             title
725        726                      Fluke (1995)
1183      1184      Endless Summer 2, The (1994)
899        900                     Kundun (1997)
394        395  Robin Hood: Men in Tights (1993)
690        691                  Dark City (1998)

In [21]:
df1.shape

(1682, 2)

In [22]:
# mergindg dataframes

In [23]:
movie=pd.merge(df,df1,on='movie id')
movie.head()

   user id  movie id  rating         ts             title
0        0        50       5  881250949  Star Wars (1977)
1      290        50       5  880473582  Star Wars (1977)
2       79        50       4  891271545  Star Wars (1977)
3        2        50       5  888552084  Star Wars (1977)
4        8        50       5  879362124  Star Wars (1977)

In [24]:
# remove the rebundant  or useless column i.e. ts
movie.drop('ts',axis=1,inplace=True)

In [25]:
movie.head()

   user id  movie id  rating             title
0        0        50       5  Star Wars (1977)
1      290        50       5  Star Wars (1977)
2       79        50       4  Star Wars (1977)
3        2        50       5  Star Wars (1977)
4        8        50       5  Star Wars (1977)

In [26]:
movie.columns

Index(['user id', 'movie id', 'rating', 'title'], dtype='object')

In [27]:
# find the number of ratings for each movie
movie['title'].value_counts()

Star Wars (1977)                   584
Contact (1997)                     509
Fargo (1996)                       508
Return of the Jedi (1983)          507
Liar Liar (1997)                   485
                                  ...
Leopard Son, The (1996)              1
Stefano Quantestorie (1993)          1
Quartier Mozart (1992)               1
Reluctant Debutante, The (1958)      1
Dadetown (1995)                      1
Name: title, Length: 1664, dtype: int64

In [28]:
movie['title'].value_counts().head(10)

Star Wars (1977)                 584
Contact (1997)                   509
Fargo (1996)                     508
Return of the Jedi (1983)        507
Liar Liar (1997)                 485
English Patient, The (1996)      481
Scream (1996)                    478
Toy Story (1995)                 452
Air Force One (1997)             431
Independence Day (ID4) (1996)    429
Name: title, dtype: int64

In [29]:
# find the average rating of each movie
movie.groupby('title')['rating'].mean().sort_values(ascending=False).head(10)

title
They Made Me a Criminal (1939)                       5.0
Marlene Dietrich: Shadow and Light (1996)            5.0
Saint of Fort Washington, The (1993)                 5.0
Someone Else's America (1995)                        5.0
Star Kid (1997)                                      5.0
Great Day in Harlem, A (1994)                        5.0
Aiqing wansui (1994)                                 5.0
Santa with Muscles (1996)                            5.0
Prefontaine (1997)                                   5.0
Entertaining Angels: The Dorothy Day Story (1996)    5.0
Name: rating, dtype: float64